micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_tim_ex.c
  /* Set the Lock level, the Break enable Bit and the Polarity, the OSSR State,
     the OSSI State, the dead time value and the Automatic Output Enable Bit */

  /* Set the BDTR bits */
  MODIFY_REG(tmpbdtr, TIM_BDTR_DTG, sBreakDeadTimeConfig->DeadTime);
  MODIFY_REG(tmpbdtr, TIM_BDTR_LOCK, sBreakDeadTimeConfig->LockLevel);
  MODIFY_REG(tmpbdtr, TIM_BDTR_OSSI, sBreakDeadTimeConfig->OffStateIDLEMode);
  MODIFY_REG(tmpbdtr, TIM_BDTR_OSSR, sBreakDeadTimeConfig->OffStateRunMode);
  MODIFY_REG(tmpbdtr, TIM_BDTR_BKE, sBreakDeadTimeConfig->BreakState);
  MODIFY_REG(tmpbdtr, TIM_BDTR_BKP, sBreakDeadTimeConfig->BreakPolarity);
  MODIFY_REG(tmpbdtr, TIM_BDTR_AOE, sBreakDeadTimeConfig->AutomaticOutput);
  MODIFY_REG(tmpbdtr, TIM_BDTR_BKF, (sBreakDeadTimeConfig->BreakFilter << TIM_BDTR_BKF_Pos));
  MODIFY_REG(tmpbdtr, TIM_BDTR_BKBID, sBreakDeadTimeConfig->BreakAFMode);

  if (IS_TIM_BKIN2_INSTANCE(htim->Instance))
  {
    /* Check the parameters */
    assert_param(IS_TIM_BREAK2_STATE(sBreakDeadTimeConfig->Break2State));
    assert_param(IS_TIM_BREAK2_POLARITY(sBreakDeadTimeConfig->Break2Polarity));
    assert_param(IS_TIM_BREAK_FILTER(sBreakDeadTimeConfig->Break2Filter));
    assert_param(IS_TIM_BREAK2_AFMODE(sBreakDeadTimeConfig->Break2AFMode));

    /* Set the BREAK2 input related BDTR bits */
    MODIFY_REG(tmpbdtr, TIM_BDTR_BK2F, (sBreakDeadTimeConfig->Break2Filter << TIM_BDTR_BK2F_Pos));
    MODIFY_REG(tmpbdtr, TIM_BDTR_BK2E, sBreakDeadTimeConfig->Break2State);
    MODIFY_REG(tmpbdtr, TIM_BDTR_BK2P, sBreakDeadTimeConfig->Break2Polarity);
    MODIFY_REG(tmpbdtr, TIM_BDTR_BK2BID, sBreakDeadTimeConfig->Break2AFMode);
  }

  /* Set TIMx_BDTR */
  htim->Instance->BDTR = tmpbdtr;

  __HAL_UNLOCK(htim);

  return HAL_OK;
}

/**
  * @brief  Configures the break input source.
  * @param  htim TIM handle.
  * @param  BreakInput Break input to configure
  *          This parameter can be one of the following values:
  *            @arg TIM_BREAKINPUT_BRK: Timer break input
  *            @arg TIM_BREAKINPUT_BRK2: Timer break 2 input
  * @param  sBreakInputConfig Break input source configuration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_ConfigBreakInput(TIM_HandleTypeDef *htim,
                                             uint32_t BreakInput,
                                             const TIMEx_BreakInputConfigTypeDef *sBreakInputConfig)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tmporx;
  uint32_t bkin_enable_mask;
  uint32_t bkin_polarity_mask;
  uint32_t bkin_enable_bitpos;
  uint32_t bkin_polarity_bitpos;

  /* Check the parameters */
  assert_param(IS_TIM_BREAK_INSTANCE(htim->Instance));
  assert_param(IS_TIM_BREAKINPUT(BreakInput));
  assert_param(IS_TIM_BREAKINPUTSOURCE(sBreakInputConfig->Source));
  assert_param(IS_TIM_BREAKINPUTSOURCE_STATE(sBreakInputConfig->Enable));
  if (sBreakInputConfig->Source != TIM_BREAKINPUTSOURCE_MDF1)
  {
    assert_param(IS_TIM_BREAKINPUTSOURCE_POLARITY(sBreakInputConfig->Polarity));
  }

  /* Check input state */
  __HAL_LOCK(htim);

  switch (sBreakInputConfig->Source)
  {
    case TIM_BREAKINPUTSOURCE_BKIN:
    {
      bkin_enable_mask = TIM_AF1_BKINE;
      bkin_enable_bitpos = TIM_AF1_BKINE_Pos;
      bkin_polarity_mask = TIM_AF1_BKINP;
      bkin_polarity_bitpos = TIM_AF1_BKINP_Pos;
      break;
    }
    case TIM_BREAKINPUTSOURCE_MDF1:
    {
      bkin_enable_mask = TIM_AF1_BKCMP8E;
      bkin_enable_bitpos = TIM_AF1_BKCMP8E_Pos;
      /* No polarity bit for MDF. Variable bkin_polarity_mask keeps its default value 0 */
      bkin_polarity_mask = 0U;
      bkin_polarity_bitpos = 0U;
      break;
    }

    default:
    {
      bkin_enable_mask = 0U;
      bkin_polarity_mask = 0U;
      bkin_enable_bitpos = 0U;
      bkin_polarity_bitpos = 0U;
      break;
    }
  }

  switch (BreakInput)
  {
    case TIM_BREAKINPUT_BRK:
    {
      /* Get the TIMx_AF1 register value */
      tmporx = htim->Instance->AF1;

      /* Enable the break input */
      tmporx &= ~bkin_enable_mask;
      tmporx |= (sBreakInputConfig->Enable << bkin_enable_bitpos) & bkin_enable_mask;

      /* Set the break input polarity */
      tmporx &= ~bkin_polarity_mask;
      tmporx |= (sBreakInputConfig->Polarity << bkin_polarity_bitpos) & bkin_polarity_mask;

      /* Set TIMx_AF1 */
      htim->Instance->AF1 = tmporx;
      break;
    }
    case TIM_BREAKINPUT_BRK2:
    {
      /* Get the TIMx_AF2 register value */
      tmporx = htim->Instance->AF2;

      /* Enable the break input */
      tmporx &= ~bkin_enable_mask;
      tmporx |= (sBreakInputConfig->Enable << bkin_enable_bitpos) & bkin_enable_mask;

      /* Set the break input polarity */
      tmporx &= ~bkin_polarity_mask;
      tmporx |= (sBreakInputConfig->Polarity << bkin_polarity_bitpos) & bkin_polarity_mask;

      /* Set TIMx_AF2 */
      htim->Instance->AF2 = tmporx;
      break;
    }
    default:
      status = HAL_ERROR;
      break;
  }

  __HAL_UNLOCK(htim);

  return status;
}

/**
  * @brief  Configures the TIMx Remapping input capabilities.
  * @param  htim TIM handle.
  * @param  Remap specifies the TIM remapping source.
  *         For TIM1, the parameter can take one of the following values:
  *            @arg TIM_TIM1_ETR_GPIO           TIM1 ETR is connected to GPIO
  *            @arg TIM_TIM1_ETR_ADC1_AWD1      TIM1 ETR is connected to ADC1 AWD1
  *            @arg TIM_TIM1_ETR_ADC1_AWD2      TIM1 ETR is connected to ADC1 AWD2
  *            @arg TIM_TIM1_ETR_ADC1_AWD3      TIM1 ETR is connected to ADC1 AWD3
  *            @arg TIM_TIM1_ETR_ADC2_AWD1      TIM1 ETR is connected to ADC4 AWD1
  *            @arg TIM_TIM1_ETR_ADC2_AWD2      TIM1 ETR is connected to ADC4 AWD2
  *            @arg TIM_TIM1_ETR_ADC2_AWD3      TIM1 ETR is connected to ADC4 AWD3
  *
  *         For TIM2, the parameter can take one of the following values:
  *            @arg TIM_TIM2_ETR_GPIO           TIM2 ETR is connected to GPIO
  *            @arg TIM_TIM2_ETR_DCMIPP_HSYNC   TIM2_ETR is connected to DCMIPP HSYNC
  *            @arg TIM_TIM2_ETR_LCD_HSYNC      TIM2_ETR is connected to LCD HSYNC
  *            @arg TIM_TIM2_ETR_SAI1_FSA       TIM2_ETR is connected to SAI1 FS_A
  *            @arg TIM_TIM2_ETR_SAI1_FSB       TIM2_ETR is connected to SAI1 FS_B
  *            @arg TIM_TIM2_ETR_GFXTIM_TE      TIM2_ETR is connected to GFXTIM TE
  *            @arg TIM_TIM2_ETR_DCMIPP_VSYNC   TIM2_ETR is connected to DCMIPP VSYNC
  *            @arg TIM_TIM2_ETR_LCD_VSYNC      TIM2_ETR is connected to LCD VSYNC
  *            @arg TIM_TIM2_ETR_TIM3_ETR       TIM2_ETR is connected to TIM3_ETR
  *            @arg TIM_TIM2_ETR_TIM4_ETR       TIM2_ETR is connected to TIM4_ETR
  *            @arg TIM_TIM2_ETR_TIM5_ETR       TIM2_ETR is connected to TIM5_ETR
  *            @arg TIM_TIM2_ETR_USB1_SOF       TIM2_ETR is connected to USB1 OTG SOF
  *            @arg TIM_TIM2_ETR_USB2_SOF       TIM2_ETR is connected to USB2 OTG SOF
  *
  *         For TIM3, the parameter can take one of the following values:
  *            @arg TIM_TIM3_ETR_GPIO           TIM3 ETR is connected to GPIO
  *            @arg TIM_TIM3_ETR_DCMIPP_HSYNC   TIM3 ETR is connected to DCMIPP HSYNC
  *            @arg TIM_TIM3_ETR_LCD_HSYNC      TIM3 ETR is connected to LCD HSYNC
  *            @arg TIM_TIM3_ETR_GFXTIM_TE      TIM3 ETR is connected to GFXTIM TE
  *            @arg TIM_TIM3_ETR_DCMIPP_VSYNC   TIM3 ETR is connected to DCMIPP VSYNC
  *            @arg TIM_TIM3_ETR_LCD_VSYNC      TIM3 ETR is connected to LCD VSYNC
  *            @arg TIM_TIM3_ETR_TIM2_ETR       TIM3 ETR is connected to TIM2 ETR
  *            @arg TIM_TIM3_ETR_TIM4_ETR       TIM3 ETR is connected to TIM4_ETR
  *            @arg TIM_TIM3_ETR_TIM5_ETR       TIM3 ETR is connected to TIM5_ETR
  *
  *         For TIM4, the parameter can take one of the following values:
  *            @arg TIM_TIM4_ETR_GPIO           TIM4 ETR is connected to GPIO
  *            @arg TIM_TIM4_ETR_DCMIPP_HSYNC   TIM4 ETR is connected to DCMIPP HSYNC
  *            @arg TIM_TIM4_ETR_LCD_HSYNC      TIM4 ETR is connected to LCD HSYNC
  *            @arg TIM_TIM4_ETR_GFXTIM_TE      TIM4 ETR is connected to GFXTIM TE
  *            @arg TIM_TIM4_ETR_DCMIPP_VSYNC   TIM4 ETR is connected to DCMIPP VSYNC
  *            @arg TIM_TIM4_ETR_LCD_VSYNC      TIM4 ETR is connected to LCD VSYNC
  *            @arg TIM_TIM4_ETR_TIM2_ETR       TIM4 ETR is connected to TIM2 ETR
  *            @arg TIM_TIM4_ETR_TIM3_ETR       TIM4 ETR is connected to TIM3_ETR
  *            @arg TIM_TIM4_ETR_TIM5_ETR       TIM4 ETR is connected to TIM5_ETR
  *
  *         For TIM5, the parameter can take one of the following values:
  *            @arg TIM_TIM5_ETR_GPIO           TIM5 ETR is connected to GPIO
  *            @arg TIM_TIM5_ETR_SAI2_FSA       TIM5_ETR is connected to SAI2 FS_A
  *            @arg TIM_TIM5_ETR_SAI2_FSB       TIM5_ETR is connected to SAI2 FS_B
  *            @arg TIM_TIM5_ETR_DCMIPP_HSYNC   TIM5 ETR is connected to DCMIPP HSYNC
  *            @arg TIM_TIM5_ETR_LCD_HSYNC      TIM5 ETR is connected to LCD HSYNC
  *            @arg TIM_TIM5_ETR_GFXTIM_TE      TIM5 ETR is connected to GFXTIM TE
  *            @arg TIM_TIM5_ETR_DCMIPP_VSYNC   TIM5 ETR is connected to DCMIPP VSYNC
  *            @arg TIM_TIM5_ETR_LCD_VSYNC      TIM5 ETR is connected to LCD VSYNC
  *            @arg TIM_TIM5_ETR_TIM2_ETR       TIM5 ETR is connected to TIM2_ETR
  *            @arg TIM_TIM5_ETR_TIM3_ETR       TIM5 ETR is connected to TIM3_ETR
  *            @arg TIM_TIM5_ETR_TIM4_ETR       TIM5 ETR is connected to TIM4_ETR
  *            @arg TIM_TIM5_ETR_USB1_SOF       TIM5_ETR is connected to USB1 OTG SOF
  *            @arg TIM_TIM5_ETR_USB2_SOF       TIM5_ETR is connected to USB2 OTG SOF
  *
  *         For TIM8, the parameter can take one of the following values:
  *            @arg TIM_TIM8_ETR_GPIO           TIM8 ETR is connected to GPIO
  *            @arg TIM_TIM8_ETR_ADC2_AWD1      TIM8 ETR is connected to ADC2 AWD1
  *            @arg TIM_TIM8_ETR_ADC2_AWD2      TIM8 ETR is connected to ADC2 AWD2
  *            @arg TIM_TIM8_ETR_ADC2_AWD3      TIM8 ETR is connected to ADC2 AWD3
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_RemapConfig(TIM_HandleTypeDef *htim, uint32_t Remap)
{
  /* Check parameters */
  assert_param(IS_TIM_REMAP(htim->Instance, Remap));

  __HAL_LOCK(htim);

  MODIFY_REG(htim->Instance->AF1, TIM_AF1_ETRSEL_Msk, Remap);

  __HAL_UNLOCK(htim);

  return HAL_OK;
}

/**
  * @brief  Select the timer input source
  * @param  htim TIM handle.
  * @param  Channel specifies the TIM Channel
  *          This parameter can be one of the following values:
  *            @arg TIM_CHANNEL_1: TI1 input channel
  *            @arg TIM_CHANNEL_2: TI2 input channel
  * @param  TISelection parameter of the TIM_TISelectionStruct structure is detailed as follows:
  *         For TIM2, the parameter is one of the following values:
  *            @arg TIM_TIM2_TI1_GPIO:                TIM2 TI1 is connected to GPIO
  *            @arg TIM_TIM2_TI1_ETH1_PPS:            TIM2 TI1 is connected to ETH1 PPS
  *
  *         For TIM3, the parameter is one of the following values:
  *            @arg TIM_TIM3_TI1_GPIO:                TIM3 TI1 is connected to GPIO
  *            @arg TIM_TIM3_TI1_ETH1_PPS:            TIM3 TI1 is connected to ETH1 PPS
  *            @arg TIM_TIM3_TI1_FDCAN_RTP            TIM3_TI1 is connected to FDCAN RTP
  *            @arg TIM_TIM3_TI1_FDCAN_TMP            TIM3_TI1 is connected to FDCAN TMP
  *            @arg TIM_TIM3_TI1_FDCAN_SOC            TIM3_TI1 is connected to FDCAN SOC
  *
  *         For TIM5, the parameter is one of the following values:
  *            @arg TIM_TIM5_TI1_GPIO:                TIM5 TI1 is connected to GPIO
  *            @arg TIM_TIM5_TI1_FDCAN_RTP            TIM5_TI1 is connected to FDCAN RTP
  *            @arg TIM_TIM5_TI1_FDCAN_TMP            TIM5_TI1 is connected to FDCAN TMP
  *
  *         For TIM9, the parameter is one of the following values:
  *            @arg TIM_TIM9_TI1_GPIO:                TIM9 TI1 is connected to GPIO
  *            @arg TIM_TIM9_TI1_MCO1:                TIM9 TI1 is connected to MCO1
  *            @arg TIM_TIM9_TI1_MCO2:                TIM9 TI1 is connected to MCO2
  *
  *         For TIM10, the parameter is one of the following values:
  *            @arg TIM_TIM10_TI1_GPIO                TIM10_TI1 is connected to GPIO
  *            @arg TIM_TIM10_TI1_I3C1_IBIACK         TIM10_TI1 is connected to I3C1 IBI ACK
  *
  *         For TIM11, the parameter is one of the following values:
  *            @arg TIM_TIM11_TI1_GPIO                TIM11_TI1 is connected to GPIO
  *            @arg TIM_TIM11_TI1_I3C2_IBIACK         TIM11_TI1 is connected to I3C2 IBI ACK
  *
  *         For TIM12, the parameter is one of the following values:
  *            @arg TIM_TIM12_TI1_GPIO:                TIM12 TI1 is connected to GPIO
  *            @arg TIM_TIM12_TI1_SPDIF_FS:            TIM12 TI1 is connected to SPDIF FS
  *            @arg TIM_TIM12_TI1_HSI_1024:            TIM12 TI1 is connected to HSI/1024
  *            @arg TIM_TIM12_TI1_MSI_128:             TIM12_TI1 is connected to MSI/128
  *            @arg TIM_TIM12_TI1_MCO1:                TIM12 TI1 is connected to MCO1
  *            @arg TIM_TIM12_TI1_MCO2:                TIM12 TI1 is connected to MCO2
  *
  *         For TIM13, the parameter is one of the following values:
  *            @arg TIM_TIM13_TI1_GPIO                TIM13_TI1 is connected to GPIO
  *            @arg TIM_TIM13_TI1_I3C1_IBIACK         TIM13_TI1 is connected to I3C1 IBI ACK
  *
  *         For TIM14, the parameter is one of the following values:
  *            @arg TIM_TIM14_TI1_GPIO                TIM14_TI1 is connected to GPIO
  *            @arg TIM_TIM14_TI1_I3C2_IBIACK         TIM14_TI1 is connected to I3C2 IBI ACK
  *
  *         For TIM15, the parameter is one of the following values:
  *            @arg TIM_TIM15_TI1_GPIO:                TIM15 TI1 is connected to GPIO
  *            @arg TIM_TIM15_TI1_TIM2_CH1:            TIM15 TI1 is connected to TIM2 CH1
  *            @arg TIM_TIM15_TI1_TIM3_CH1:            TIM15 TI1 is connected to TIM3 CH1
  *            @arg TIM_TIM15_TI1_TIM4_CH1:            TIM15 TI1 is connected to TIM4 CH1
  *            @arg TIM_TIM15_TI1_MCO1:                TIM15 TI1 is connected to MCO1
  *            @arg TIM_TIM15_TI1_MCO2:                TIM15 TI1 is connected to MCO2
  *            @arg TIM_TIM15_TI2_GPIO:                TIM15 TI2 is connected to GPIO
  *            @arg TIM_TIM15_TI2_TIM2_CH2:            TIM15 TI2 is connected to TIM2 CH2
  *            @arg TIM_TIM15_TI2_TIM3_CH2:            TIM15 TI2 is connected to TIM3 CH2
  *            @arg TIM_TIM15_TI2_TIM4_CH2:            TIM15 TI2 is connected to TIM4 CH2
  *
  *         For TIM16, the parameter is one of the following values:
  *            @arg TIM_TIM16_TI1_GPIO:                TIM16 TI1 is connected to GPIO
  *            @arg TIM_TIM16_TI1_LSI                  TIM16 TI1 is connected to LSI
  *            @arg TIM_TIM16_TI1_LSE                  TIM16 TI1 is connected to LSE
  *            @arg TIM_TIM16_TI1_RTC_WKUP:            TIM16 TI1 is connected to RTC wakeup interrupt
  *
  *         For TIM17, the parameter is one of the following values:
  *            @arg TIM_TIM17_TI1_GPIO:                TIM17 TI1 is connected to GPIO
  *            @arg TIM_TIM17_TI1_SPDIF_FS:            TIM17 TI1 is connected to SPDIF FS
  *            @arg TIM_TIM17_TI1_HSE_1024:            TIM17 TI1 is connected to HSE/1024
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_TIMEx_TISelection(TIM_HandleTypeDef *htim, uint32_t TISelection, uint32_t Channel)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_TIM_TISEL_TIX_INSTANCE(htim->Instance, Channel));
  assert_param(IS_TIM_TISEL(TISelection));

  __HAL_LOCK(htim);

  switch (Channel)
  {
    case TIM_CHANNEL_1:
      MODIFY_REG(htim->Instance->TISEL, TIM_TISEL_TI1SEL, TISelection);
      break;
    case TIM_CHANNEL_2:
      MODIFY_REG(htim->Instance->TISEL, TIM_TISEL_TI2SEL, TISelection);
      break;
    default:
      status = HAL_ERROR;
      break;
  }

  __HAL_UNLOCK(htim);

